wolfSSL/wolfBoot/hal/stm32n6.c
/* stm32n6.c
 *
 * Copyright (C) 2025 wolfSSL Inc.
 *
 * This file is part of wolfBoot.
 *
 * wolfBoot is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * wolfBoot is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1335, USA
 */

#include <stdint.h>
#include <stddef.h>
#include <string.h>
#include <image.h>
#include "hal.h"
#include "hal/stm32n6.h"
#include "printf.h"
#include "hal/armv8m_tz.h"

/* OCTOSPI register definitions come from hal/spi/spi_drv_stm32.h (included
 * via stm32n6.h). STM32N6 XSPI2 uses the same IP block as OCTOSPI.
 *
 * Note: We cannot reuse qspi_transfer() from spi_drv_stm32.c because it
 * disables/enables the peripheral on each transfer. The N6 boots via XIP
 * (memory-mapped mode on XSPI2), so we need custom transfer code that:
 *  1) Aborts memory-mapped mode before indirect access
 *  2) Restores memory-mapped mode after each operation
 *  3) Runs from SRAM (RAMFUNCTION) when called from XIP code
 */

/* SPI mode values for OCTOSPI CCR fields */
#define SPI_MODE_NONE       0
#define SPI_MODE_SINGLE     1

/* RAMFUNCTION override for test-app (XIP needs flash ops in SRAM) */
#if defined(RAM_CODE) && !defined(__WOLFBOOT)
    #undef RAMFUNCTION
    #define RAMFUNCTION __attribute__((used,section(".ramcode"),long_call))
#endif

/* OCTOSPI indirect-mode command helper.
 * Handles memory-mapped mode abort/restore and TEF error detection. */
static int RAMFUNCTION octospi_cmd(uint8_t fmode, uint8_t cmd,
    uint32_t addr, uint32_t addrMode,
    uint8_t *data, uint32_t dataSz, uint32_t dataMode,
    uint32_t dummyCycles)
{
    uint32_t ccr;

    /* Abort memory-mapped mode if active */
    if ((OCTOSPI_CR & OCTOSPI_CR_FMODE_MASK) == OCTOSPI_CR_FMODE_MMAP) {
        OCTOSPI_CR |= OCTOSPI_CR_ABORT;
        while (OCTOSPI_CR & OCTOSPI_CR_ABORT)
            ;
    }
    while (OCTOSPI_SR & OCTOSPI_SR_BUSY)
        ;
    OCTOSPI_FCR = OCTOSPI_FCR_CTCF | OCTOSPI_FCR_CTEF | OCTOSPI_FCR_CSMF;

    OCTOSPI_CR = (OCTOSPI_CR & ~OCTOSPI_CR_FMODE_MASK) |
                 OCTOSPI_CR_FMODE(fmode);

    if (dataSz > 0) {
        OCTOSPI_DLR = dataSz - 1;
    }

    ccr = OCTOSPI_CCR_IMODE(SPI_MODE_SINGLE) | OCTOSPI_CCR_ISIZE(0);
    if (addrMode != SPI_MODE_NONE) {
        ccr |= OCTOSPI_CCR_ADMODE(addrMode) | OCTOSPI_CCR_ADSIZE(3);
    }
    if (dataMode != SPI_MODE_NONE) {
        ccr |= OCTOSPI_CCR_DMODE(dataMode);
    }
    OCTOSPI_CCR = ccr;
    OCTOSPI_TCR = OCTOSPI_TCR_DCYC(dummyCycles);
    OCTOSPI_IR = cmd;

    if (addrMode != SPI_MODE_NONE) {
        OCTOSPI_AR = addr;
    }

    /* Byte-wide DR access driven by FLEVEL instead of FTF. DR32-with-FTHRES
     * polling stalls on transfers > FIFO depth (32 B) because the assumed
     * "FTF means 4 bytes are ready" can race with the FIFO state once we've
     * drained/filled below the threshold and the controller doesn't reassert
     * FTF for the trailing bytes. Polling FLEVEL directly is correct for any
     * transfer size and any threshold. */
    if (dataSz > 0 && data != NULL) {
        uint32_t sr;
        while (dataSz > 0) {
            sr = OCTOSPI_SR;
            if (sr & OCTOSPI_SR_TEF) goto octospi_err;
            if (fmode == 0) {
                /* indirect write: push a byte if FIFO has free space */
                if (OCTOSPI_SR_FLEVEL(sr) < 32) {
                    OCTOSPI_DR = *data;
                    data++;
                    dataSz--;
                }
            } else {
                /* indirect read: pop a byte if FIFO has data */
                if (OCTOSPI_SR_FLEVEL(sr) > 0) {
                    *data = OCTOSPI_DR;
                    data++;
                    dataSz--;
                } else if (sr & OCTOSPI_SR_TCF) {
                    /* Transfer complete and FIFO drained -- should not
                     * happen with dataSz > 0 unless DLR mismatch. */
                    goto octospi_err;
                }
            }
        }
    }

    while (!(OCTOSPI_SR & (OCTOSPI_SR_TCF | OCTOSPI_SR_TEF)))
        ;
    if (OCTOSPI_SR & OCTOSPI_SR_TEF) goto octospi_err;
    OCTOSPI_FCR = OCTOSPI_FCR_CTCF;

    return 0;

octospi_err:
    OCTOSPI_FCR = OCTOSPI_FCR_CTEF;
    OCTOSPI_CR |= OCTOSPI_CR_ABORT;
    while (OCTOSPI_CR & OCTOSPI_CR_ABORT)
        ;
    return -1;
}

static int RAMFUNCTION octospi_write_enable(void)
{
    /* A failed WREN leaves the latch clear: the device then ignores the
     * program/erase, never goes BUSY, and octospi_wait_ready() reports
     * idle on its first poll. */
    return octospi_cmd(0, WRITE_ENABLE_CMD, 0, SPI_MODE_NONE,
                       NULL, 0, SPI_MODE_NONE, 0);
}

static int RAMFUNCTION octospi_wait_ready(void)
{
    uint8_t sr;
    do {
        sr = 0;
        /* A failed status-register transfer must not read as "ready":
         * sr stays zero and the loop would exit as if the flash were idle. */
        if (octospi_cmd(1, READ_SR_CMD, 0, SPI_MODE_NONE,
                        &sr, 1, SPI_MODE_SINGLE, 0) < 0)
            return -1;
    } while (sr & FLASH_SR_BUSY);
    return 0;
}

static void RAMFUNCTION octospi_enable_mmap(void)
{
    if ((OCTOSPI_CR & OCTOSPI_CR_FMODE_MASK) == OCTOSPI_CR_FMODE_MMAP) {
        OCTOSPI_CR |= OCTOSPI_CR_ABORT;
        while (OCTOSPI_CR & OCTOSPI_CR_ABORT)
            ;
    }
    while (OCTOSPI_SR & OCTOSPI_SR_BUSY)
        ;
    OCTOSPI_FCR = OCTOSPI_FCR_CTCF | OCTOSPI_FCR_CTEF | OCTOSPI_FCR_CSMF;

    OCTOSPI_CR = (OCTOSPI_CR & ~OCTOSPI_CR_FMODE_MASK) |
                 OCTOSPI_CR_FMODE_MMAP;

    /* Single-SPI FAST_READ_4B (0x0C), 4-byte address, 8 dummy cycles.
     * The MX25UM51245G is in default single-SPI mode after Boot ROM
     * hand-off. */
    OCTOSPI_CCR = OCTOSPI_CCR_IMODE(SPI_MODE_SINGLE) |
                  OCTOSPI_CCR_ISIZE(0) |
                  OCTOSPI_CCR_ADMODE(SPI_MODE_SINGLE) |
                  OCTOSPI_CCR_ADSIZE(3) |
                  OCTOSPI_CCR_DMODE(SPI_MODE_SINGLE);
    OCTOSPI_TCR = OCTOSPI_TCR_DCYC(8);
    OCTOSPI_IR = FAST_READ_4B_CMD;

    DSB();
    ISB();
}

static void RAMFUNCTION dcache_clean_invalidate_by_addr(uint32_t addr,
    uint32_t size)
{
    uint32_t line;
    for (line = addr & ~0x1FUL; line < addr + size; line += 32) {
        SCB_DCCIMVAC = line;
    }
    DSB();
    ISB();
}

