wolfSSL/wolfBoot/hal/stm32n6.c
static void icache_enable(void)
{
    DSB();
    ISB();
    SCB_ICIALLU = 0;
    DSB();
    ISB();
    SCB_CCR |= SCB_CCR_IC;
    DSB();
    ISB();
}

static void dcache_enable(void)
{
    DSB();
    SCB_CCR |= SCB_CCR_DC;
    DSB();
    ISB();
}

static void icache_disable(void)
{
    DSB();
    ISB();
    SCB_CCR &= ~SCB_CCR_IC;
    SCB_ICIALLU = 0;
    DSB();
    ISB();
}

static void dcache_disable(void)
{
    /* Clean+invalidate all lines by set/way before disabling */
    uint32_t sets, ways, set, way, way_shift, tmp;
    uint32_t ccsidr;

    CSSELR = 0; /* select L1 data cache */
    DSB();
    ccsidr = CCSIDR;
    sets = ((ccsidr >> 13) & 0x7FFF) + 1;
    ways = ((ccsidr >> 3) & 0x3FF) + 1;

    /* Calculate way shift: 32 - log2(ways) */
    way_shift = 32;
    tmp = ways - 1;
    while (tmp) {
        way_shift--;
        tmp >>= 1;
    }

    for (way = 0; way < ways; way++) {
        for (set = 0; set < sets; set++) {
            SCB_DCCISW = (way << way_shift) | (set << 5);
        }
    }

    DSB();
    SCB_CCR &= ~SCB_CCR_DC;
    DSB();
    ISB();
}

/* OCTOSPI GPIO: PN0-PN11 as AF9 (DQS, CLK, NCS, IO0-IO7) */
static void octospi_gpio_init(void)
{
    uint32_t reg;
    int pin;

    RCC_AHB4ENR |= RCC_AHB4ENR_GPIONEN;
    DMB();

    /* AF mode, very high speed, no pull */
    reg = GPIO_MODER(GPION_BASE);
    for (pin = 0; pin <= 11; pin++) {
        reg &= ~(0x3 << (pin * 2));
        reg |= (GPIO_MODE_AF << (pin * 2));
    }
    GPIO_MODER(GPION_BASE) = reg;

    reg = GPIO_OSPEEDR(GPION_BASE);
    for (pin = 0; pin <= 11; pin++) {
        reg &= ~(0x3 << (pin * 2));
        reg |= (GPIO_SPEED_VERY_HIGH << (pin * 2));
    }
    GPIO_OSPEEDR(GPION_BASE) = reg;

    reg = GPIO_PUPDR(GPION_BASE);
    for (pin = 0; pin <= 11; pin++) {
        reg &= ~(0x3 << (pin * 2));
    }
    GPIO_PUPDR(GPION_BASE) = reg;

    /* AF9 for PN0-PN7 (AFRL) and PN8-PN11 (AFRH) */
    reg = 0;
    for (pin = 0; pin <= 7; pin++) {
        reg |= (9 << (pin * 4));
    }
    GPIO_AFRL(GPION_BASE) = reg;

    reg = 0;
    for (pin = 0; pin <= 3; pin++) {
        reg |= (9 << (pin * 4));
    }
    GPIO_AFRH(GPION_BASE) = reg;
}

static void octospi_init(void)
{
    /* Bring up XSPI2 from the state Boot ROM leaves. Boot ROM:
     *  - loads the FSBL via XSPI2, then disables the peripheral (CR.EN=0)
     *    and clears DCR1 (DEVSIZE=0)
     *  - leaves XSPIM_CR with MODE=1, which on N6 SWAPS the XSPI<->Port
     *    routing (XSPI2->Port 1, XSPI1->Port 2). The MX25UM51245G is wired
     *    to Port 2, so XSPI2 must be re-routed there before we can talk
     *    to the flash
     *  - leaves the flash itself in single-SPI mode (NOT OPI as initially
     *    suspected; single SPI works fine with FAST_READ_4B)
     */
    RCC_AHB5ENR |= RCC_AHB5ENR_XSPI2EN | RCC_AHB5ENR_XSPIMEN;
    RCC_MISCENR |= RCC_MISCENR_XSPIPHYCOMPEN;
    DMB();

    /* VDDIO3 powers the XSPI2 IO bank. The MX25UM51245G runs at 1.8V on
     * NUCLEO-N657X0-Q, so configure VDDIO3 voltage range = 1.8V (bit 26).
     * Then mark VDDIO3 supply valid. */
    RCC_AHB4ENR |= RCC_AHB4ENR_PWREN;
    DMB();
    PWR_SVMCR3 |= PWR_SVMCR3_VDDIO3VRSEL;   /* 1.8V range */
    PWR_SVMCR3 |= PWR_SVMCR3_VDDIO3SV;      /* supply valid */
    DMB();

    /* XSPIM_CR is only writable while BOTH XSPI1 and XSPI2 are CR.EN=0.
     * Force XSPI1 disabled (Boot ROM enabled its clock and may have left
     * EN set), then RCC-reset XSPI2 to clear its Boot-ROM-leftover state. */
    XSPI1_CR &= ~XSPI_CR_EN;
    DMB();
    RCC_AHB5RSTSR = RCC_AHB5RSTR_XSPI2RST;
    DMB();
    RCC_AHB5RSTCR = RCC_AHB5RSTR_XSPI2RST;
    DMB();

    /* Direct mapping: XSPI2 -> Port 2. Without this, XSPI2 signals don't
     * reach the flash and all reads time out. */
    XSPIM_CR = 0;
    DMB();

    /* Set DEVSIZE for the 64 MB MX25UM51245G (DEVSIZE = log2(size)-1 = 25);
     * CSHT (CS high time) = 3; keep DLYBYP. Prescaler /4 (matches ST BSP). */
    OCTOSPI_DCR1 = OCTOSPI_DCR1_DLYBYP |
                   OCTOSPI_DCR1_DEVSIZE(25) |
                   OCTOSPI_DCR1_CSHT(3);
    OCTOSPI_DCR2 = OCTOSPI_DCR2_PRESCALER(4);

    /* Enable peripheral. FTHRES=4 matches DR32 word access from mmap.
     * XIP mmap requires D-cache enabled and cache-line burst access;
     * single-word XIP reads or non-cacheable mapping stall OCTOSPI with
     * BUSY=1 + full FIFO. */
    OCTOSPI_CR = OCTOSPI_CR_FTHRES(4) | OCTOSPI_CR_EN;

    octospi_enable_mmap();
}

/* Configure clocks: PLL1 → 600 MHz CPU (Voltage Scale 1).
 * STM32N6 supports up to 800 MHz at Voltage Scale 0 (PWR_VOSCR_VOS=1).
 *
 * Clock tree:
 *   HSI 64 MHz → PLL1 (M=4, N=75) → VCO 1200 MHz → PDIV1=1 → 1200 MHz
 *     IC1 /2 = 600 MHz → CPU (CPUSW=IC1)
 *     IC2 /3 = 400 MHz → AXI bus (SYSSW=IC2)
 *     IC6 /4 = 300 MHz → system bus C (SYSSW=IC6)
 *     IC11/3 = 400 MHz → system bus D (SYSSW=IC11)
 *   AHB prescaler /2 → HCLK = 300 MHz
 */
static void clock_config(void)
{
    uint32_t reg;

    /* Enable HSI 64 MHz */
    RCC_CSR = RCC_CR_HSION;
    while (!(RCC_SR & RCC_SR_HSIRDY))
        ;

    /* Switch CPU and system buses back to HSI BEFORE disabling PLL1.
     * The Boot ROM has already moved CPU/SYS to PLL1-sourced IC1/IC2/IC6/IC11
     * for cold boot; clearing PLL1ON while CPU runs on PLL1 stops the CPU
     * clock and hangs the part. (When loaded via OpenOCD the CPU is on
     * reset-state HSI, which masked this on the development path.) */
    reg = RCC_CFGR1;
    reg &= ~(RCC_CFGR1_CPUSW_MASK | RCC_CFGR1_SYSSW_MASK);
    RCC_CFGR1 = reg;
    while ((RCC_CFGR1 & RCC_CFGR1_CPUSWS_MASK) != 0)
        ;
    while ((RCC_CFGR1 & RCC_CFGR1_SYSSWS_MASK) != 0)
        ;

    /* Disable PLL1 before reconfiguring */
    RCC_CCR = RCC_CR_PLL1ON;
    while (RCC_SR & RCC_SR_PLL1RDY)
        ;

    /* PLL1: HSI / 4 * 75 = 1200 MHz VCO.
     * Clear BYP (bypass) — Boot ROM leaves it set, which routes HSI
     * directly to PLL output, skipping the VCO entirely. */
    reg = RCC_PLL1CFGR1;
    reg &= ~(RCC_PLL1CFGR1_SEL_MASK | RCC_PLL1CFGR1_DIVM_MASK |
             RCC_PLL1CFGR1_DIVN_MASK | RCC_PLL1CFGR1_BYP);
    reg |= RCC_PLL1CFGR1_SEL_HSI |
           (4 << RCC_PLL1CFGR1_DIVM_SHIFT) |
           (75 << RCC_PLL1CFGR1_DIVN_SHIFT);
    RCC_PLL1CFGR1 = reg;

