wolfSSL/wolfBoot/hal/stm32n6.c
    RCC_PLL1CFGR2 = 0; /* no fractional */

    /* PDIV1=1, PDIV2=1 → PLL output = VCO = 1200 MHz.
     * MODSSDIS: disable spread spectrum. PDIVEN: enable PLL output. */
    RCC_PLL1CFGR3 = (1 << RCC_PLL1CFGR3_PDIV1_SHIFT) |
                    (1 << RCC_PLL1CFGR3_PDIV2_SHIFT) |
                    RCC_PLL1CFGR3_MODSSDIS |
                    RCC_PLL1CFGR3_MODSSRST |
                    RCC_PLL1CFGR3_PDIVEN;

    /* Enable PLL1, wait for lock */
    RCC_CSR = RCC_CR_PLL1ON;
    while (!(RCC_SR & RCC_SR_PLL1RDY))
        ;

    /* Configure IC dividers: disable → configure → re-enable.
     * IC divider = INT + 1, SEL: 0=PLL1 (per ST LL driver). */
    RCC_DIVENCR = RCC_DIVENR_IC1EN;
    RCC_IC1CFGR = RCC_ICCFGR_SEL_PLL1 | ((2 - 1) << RCC_ICCFGR_INT_SHIFT);
    RCC_DIVENSR = RCC_DIVENR_IC1EN;

    RCC_DIVENCR = RCC_DIVENR_IC2EN;
    RCC_IC2CFGR = RCC_ICCFGR_SEL_PLL1 | ((3 - 1) << RCC_ICCFGR_INT_SHIFT);
    RCC_DIVENSR = RCC_DIVENR_IC2EN;

    RCC_DIVENCR = RCC_DIVENR_IC6EN;
    RCC_IC6CFGR = RCC_ICCFGR_SEL_PLL1 | ((4 - 1) << RCC_ICCFGR_INT_SHIFT);
    RCC_DIVENSR = RCC_DIVENR_IC6EN;

    RCC_DIVENCR = RCC_DIVENR_IC11EN;
    RCC_IC11CFGR = RCC_ICCFGR_SEL_PLL1 | ((3 - 1) << RCC_ICCFGR_INT_SHIFT);
    RCC_DIVENSR = RCC_DIVENR_IC11EN;

    /* AHB prescaler /2 → HCLK = 300 MHz */
    reg = RCC_CFGR2;
    reg &= ~RCC_CFGR2_HPRE_MASK;
    reg |= (1 << RCC_CFGR2_HPRE_SHIFT);
    RCC_CFGR2 = reg;

    /* Switch CPU to IC1, system bus to IC2/IC6/IC11 */
    reg = RCC_CFGR1;
    reg &= ~(RCC_CFGR1_CPUSW_MASK | RCC_CFGR1_SYSSW_MASK);
    reg |= (0x3 << RCC_CFGR1_CPUSW_SHIFT) |
           (0x3 << RCC_CFGR1_SYSSW_SHIFT);
    RCC_CFGR1 = reg;
    while ((RCC_CFGR1 & RCC_CFGR1_CPUSWS_MASK) !=
           (0x3 << RCC_CFGR1_CPUSWS_SHIFT))
        ;
    while ((RCC_CFGR1 & RCC_CFGR1_SYSSWS_MASK) !=
           (0x3 << RCC_CFGR1_SYSSWS_SHIFT))
        ;
}

#ifdef DEBUG_UART
/* USART1 on PE5 (TX) / PE6 (RX), AF7 */

#define UART_BASE        USART1_BASE
#define UART_CLOCK_FREQ  200000000UL /* PCLK2 = IC2(400MHz) / AHB(2) / APB2(1) */

static void uart_init_baud(uint32_t baud)
{
    uint32_t reg;

    RCC_APB2ENR |= RCC_APB2ENR_USART1EN;
    RCC_AHB4ENR |= RCC_AHB4ENR_GPIOEEN;
    DMB();

    /* PE5/PE6 AF mode */
    reg = GPIO_MODER(GPIOE_BASE);
    reg &= ~((0x3 << (5 * 2)) | (0x3 << (6 * 2)));
    reg |= (GPIO_MODE_AF << (5 * 2)) | (GPIO_MODE_AF << (6 * 2));
    GPIO_MODER(GPIOE_BASE) = reg;

    /* AF7 */
    reg = GPIO_AFRL(GPIOE_BASE);
    reg &= ~((0xF << (5 * 4)) | (0xF << (6 * 4)));
    reg |= (7 << (5 * 4)) | (7 << (6 * 4));
    GPIO_AFRL(GPIOE_BASE) = reg;

    reg = GPIO_OSPEEDR(GPIOE_BASE);
    reg &= ~((0x3 << (5 * 2)) | (0x3 << (6 * 2)));
    reg |= (GPIO_SPEED_HIGH << (5 * 2)) | (GPIO_SPEED_HIGH << (6 * 2));
    GPIO_OSPEEDR(GPIOE_BASE) = reg;

    /* 8N1 */
    UART_CR1(UART_BASE) = 0;
    UART_CR2(UART_BASE) = 0;
    UART_CR3(UART_BASE) = 0;
    UART_BRR(UART_BASE) = (UART_CLOCK_FREQ + baud / 2) / baud;
    UART_CR1(UART_BASE) = USART_CR1_TE | USART_CR1_RE | USART_CR1_UE;
}

void uart_write(const char *buf, unsigned int len)
{
    unsigned int i;
    for (i = 0; i < len; i++) {
        while (!(UART_ISR(UART_BASE) & USART_ISR_TXE))
            ;
        UART_TDR(UART_BASE) = buf[i];
    }
    while (!(UART_ISR(UART_BASE) & USART_ISR_TC))
        ;
}
#endif

/* Mark VDDIO supplies valid (required for OCTOSPI GPIO) */
static void pwr_enable_io_supply(void)
{
    RCC_AHB4ENR |= RCC_AHB4ENR_PWREN;
    DMB();
    PWR_SVMCR1 |= PWR_SVMCR1_VDDIO4SV;
    PWR_SVMCR2 |= PWR_SVMCR2_VDDIO5SV;
    PWR_SVMCR3 |= PWR_SVMCR3_VDDIO2SV | PWR_SVMCR3_VDDIO3SV;
    DMB();
}


void hal_init(void)
{
#ifdef TZEN
    /* TrustZone enabled: wolfBoot runs Secure, NS app runs Non-Secure.
     *
     * Per ST's Template_Isolation_XIP reference (NUCLEO-N657X0-Q,
     * STM32CubeN6 v1.3.0): the N6 IDAU defers to SAU for the XSPI2
     * address range, so a SAU NS region over the secure-alias address
     * 0x70xxxxxx actually classifies the access as NS. This matches
     * ST's pattern of running the NS app at 0x70180400 (secure alias)
     * with SAU REG[3] NS 0x70180000-0x701FFFFF. We mirror that here.
     *
     * SAU regions (only where we override IDAU default):
     *   REG[0]: NS, 0x24000000..0x240FFFFF  -- AXISRAM1 NS alias
     *                                          (NS app stack/data)
     *   REG[1]: NS, 0x40000000..0x4FFFFFFF  -- peripherals NS alias
     *                                          (NS app UART/GPIO)
     *   REG[2]: NS, 0x70020000..0x7011FFFF  -- XSPI2 NOR boot
     *                                          partition (NS XIP)
     *
     * Addresses outside these regions fall back to IDAU defaults --
     * wolfBoot's own code/data at 0x34180400 (AXISRAM2 S alias) stays
     * Secure, the XSPI2 update/swap regions stay Secure. */
    {
        SAU_CTRL = 0;
        DSB();
        sau_init_region(0, 0x24000000, 0x240FFFE0, 0); /* NS: AXISRAM1   */
        sau_init_region(1, 0x40000000, 0x4FFFFFE0, 0); /* NS: peripherals*/
        sau_init_region(2, 0x70180000, 0x7027FFE0, 0); /* NS: boot part. */
        SAU_CTRL = SAU_INIT_CTRL_ENABLE;
        DSB();
        ISB();

        /* Enable SecureFault handler so TZ violations surface rather
         * than escalating silently. */
        SCB_SHCSR |= SCB_SHCSR_SECUREFAULT_EN;
    }
#else
    /* No TrustZone: blanket NSC region allows secure CPU to access all
     * memory regardless of IDAU attribution, so wolfBoot can read XIP
     * flash and NS peripherals. */
    {
        SAU_CTRL = 0;
        DSB();
        sau_init_region(0, 0x00000000, 0xFFFFFFE0, 1); /* full range, NSC */
        SAU_CTRL = SAU_INIT_CTRL_ENABLE;
        DSB();
        ISB();
    }
#endif
    clock_config();
    pwr_enable_io_supply();
    icache_enable();
    octospi_gpio_init();
    octospi_init();

    dcache_enable();

#ifdef DEBUG_UART
    uart_init_baud(115200);
    uart_write("wolfBoot Init\n", 14);
    wolfBoot_printf("TrustZone: %s\n",
    #if TZ_SECURE()
        "Secure"
    #else
        "Off"
    #endif
    );
#endif

