wolfSSL/wolfBoot/hal/stm32n6.c
#if TZ_SECURE()
    /* RISAF12 secure phase: cover the full 64 MB XSPI2 NOR window
     * with a base SEC region so wolfBoot's secure-side reads of the
     * boot partition (via 0x70020000) and writes to swap/update
     * succeed. The N6 bus matrix tags transactions by CPU state, not
     * by SAU effective attribute, so a secure CPU cannot "downgrade"
     * its access to NS via SAU alone -- the only way to give the NS
     * application access to the same flash is to flip subregion A to
     * NS just before BLXNS (see hal_prepare_boot()).
     *
     * After Boot ROM hand-off RISAF12 has all regions disabled,
     * which lets secure reads work but blocks NS reads. We make that
     * explicit here so the post-BLXNS NS-side XIP fetch doesn't
     * silently return RAZ. */
    *(volatile uint32_t *)(0x56028258) |= (1u << 14); /* RCC AHB3ENR.RISAFEN */
    DSB();
    /* REG[0] (base region 1): SEC for the 128 KB bootloader area
     * (0..0x1FFFF, ends right before the boot partition). */
    *(volatile uint32_t *)(0x54031044) = 0x00000000;
    *(volatile uint32_t *)(0x54031048) = 0x0001FFFF;
    *(volatile uint32_t *)(0x5403104C) = 0x00FF00FF;
    *(volatile uint32_t *)(0x54031040) = 0x00FF0101;  /* BREN|SEC|PRIV */
    DSB();
#endif

    /* Warmup the OCTOSPI mmap path with one read of the boot partition.
     * Without this delay and warmup access the first XIP read from
     * wolfBoot_start stalls (BUSY stays set indefinitely). */
    {
        volatile uint32_t i;
        volatile uint32_t warmup;
        for (i = 0; i < 100000; i++) {}
        warmup = *(volatile const uint32_t *)WOLFBOOT_PARTITION_BOOT_ADDRESS;
        (void)warmup;
    }
}

void hal_prepare_boot(void)
{
    octospi_enable_mmap();
    dcache_disable();
    icache_disable();
    /* The RISAF12 split (NS for boot partition, SEC elsewhere) is
     * applied later by stm32n6_tz_handoff() in do_boot() so wolfBoot's
     * own reads of the vector table from the boot partition still
     * pass the SEC base region installed by hal_init(). */
}

#if TZ_SECURE()
/* Reconfigure RIF for the secure -> non-secure hand-off. Called from
 * do_boot() right before BLXNS, after the secure side has finished
 * all of its boot-partition reads.
 *
 * Address-to-RISAF mapping per N6 CMSIS header (RIF_AWARE_PERIPH_INDEX
 * _RISAF*):
 *   - RISAF2 (0x54027000) -> AXISRAM1 (SRAM1_AXI at 0x34000000 /
 *                                       0x24000000), 1 MB total
 *   - RISAF3 (0x54028000) -> AXISRAM2 (SRAM2_AXI at 0x34100000 /
 *                                       0x24100000) -- wolfBoot lives
 *                                       here; leave at default SEC
 *   - RISAF12 (0x54031000) -> XSPI2 NOR XIP (64 MB at 0x70000000 /
 *                                            0x90000000)
 *
 * RISAF12 (XSPI2 NOR) -- three non-overlapping base regions:
 *   REG[0]: SEC, 0..0x1FFFF       (bootloader + swap below boot)
 *   REG[1]: NS,  0x20000..0x11FFFF (boot partition -- NS XIP)
 *   REG[2]: SEC, 0x120000..end    (update partition + remainder)
 *
 * RISAF2 (AXISRAM1) -- one base region:
 *   REG[0]: NS, 0..0xFFFFF (full 1 MB)
 *
 * The NS application links its stack at 0x24020000 (top of a 64 KB
 * RAM region at 0x24010000) and its .data/.bss at 0x24010000+, so
 * AXISRAM1 needs an NS-attributed RIF view for the NS CPU to push
 * registers and access globals.
 */
void RAMFUNCTION stm32n6_tz_handoff(void)
{
    /* Disable the bootloader-area RISAF12 SEC region installed by
     * hal_init(). Reason: RISAF filters by CPU security state (not
     * by bus HNONSEC), so leaving REG[0] SEC active would still
     * gate the BLXNS pre-attribution check the secure CPU performs
     * on the NS entry point at 0x70020XXX -- which is inside the
     * boot partition, not bootloader, but the secure-side
     * verification path may also touch the swap sector below it.
     *
     * With all RISAF12 regions disabled the default is allow-all,
     * so both the secure CPU (during the BLXNS target check) and
     * the NS CPU (during post-BLXNS XIP fetches) can read the
     * boot partition. We still configure RISAF2 for AXISRAM1 NS so
     * the NS application's stack pushes succeed.
     *
     * If later we need stricter isolation, the right shape is a
     * RISAF12 region that admits BOTH S and NS transactions via
     * the CID whitelist (set SEC=0 with WRENC/RDENC=0xFF and rely
     * on the bus matrix promoting accesses). The current N6 silicon
     * does not appear to honor that for the secure CPU's pre-check
     * on BLXNS targets, hence the all-default approach. */
    *(volatile uint32_t *)(0x54031040) = 0x00000000; /* REG[0] CFGR: BREN=0 */
    *(volatile uint32_t *)(0x54031080) = 0x00000000; /* REG[1] CFGR: BREN=0 */
    *(volatile uint32_t *)(0x540310C0) = 0x00000000; /* REG[2] CFGR: BREN=0 */
    DSB();

    /* RISAF2 (AXISRAM1) NS region for NS app RAM. NS app's stack
     * lives at 0x24010000-0x2401FFFF (NS alias of AXISRAM1 offset
     * 0x10000-0x1FFFF); this region admits NS transactions for the
     * full 1 MB bank. */
    *(volatile uint32_t *)(0x54027044) = 0x00000000;
    *(volatile uint32_t *)(0x54027048) = 0x000FFFFF;
    *(volatile uint32_t *)(0x5402704C) = 0x00FF00FF;
    *(volatile uint32_t *)(0x54027040) = 0x00FF0001;  /* BREN|NS|PRIV */
    DSB();
}
#endif

/* Shared NOR flash helpers used by both hal_flash_* and ext_flash_* */
static int RAMFUNCTION nor_flash_write(uint32_t offset, const uint8_t *data,
    int len)
{
    uint32_t page_off, write_sz;
    int remaining = len;
    int ret = 0;
    /* Buffer for data that may reside in XIP flash (memory-mapped XSPI2).
     * The source pointer becomes invalid once XSPI2 leaves mmap mode for
     * the SPI page-program command, so we copy to RAM first. */
    uint8_t page_buf[FLASH_PAGE_SIZE];

    if (len <= 0)
        return 0;

    while (remaining > 0) {
        page_off = offset & (FLASH_PAGE_SIZE - 1);
        write_sz = FLASH_PAGE_SIZE - page_off;
        if ((int)write_sz > remaining)
            write_sz = remaining;

        memcpy(page_buf, data, write_sz);

