wolfSSL/wolfBoot/hal/stm32n6.c
        if (octospi_write_enable() < 0) {
            ret = -1;
            break;
        }
        ret = octospi_cmd(0, PAGE_PROG_4B_CMD,
                 offset, SPI_MODE_SINGLE,
                 page_buf, write_sz, SPI_MODE_SINGLE, 0);
        if (ret < 0)
            break;

        if (octospi_wait_ready() < 0) {
            ret = -1;
            break;
        }

        offset += write_sz;
        data += write_sz;
        remaining -= write_sz;
    }

    octospi_enable_mmap();
    return ret;
}

static int RAMFUNCTION nor_flash_erase(uint32_t offset, int len)
{
    uint32_t end;
    int ret = 0;

    if (len <= 0)
        return -1;

    end = offset + len;

    while (offset < end) {
        if (octospi_write_enable() < 0) {
            ret = -1;
            break;
        }
        ret = octospi_cmd(0, SEC_ERASE_4B_CMD,
                 offset, SPI_MODE_SINGLE,
                 NULL, 0, SPI_MODE_NONE, 0);
        if (ret < 0)
            break;

        if (octospi_wait_ready() < 0) {
            ret = -1;
            break;
        }
        offset += FLASH_SECTOR_SIZE;
    }

    octospi_enable_mmap();
    return ret;
}

/* Forward declaration: ext_flash_addr is defined below alongside the
 * ext_flash_* API but is shared with the hal_flash_* path. */
static uint32_t RAMFUNCTION ext_flash_addr(uintptr_t address);

int RAMFUNCTION hal_flash_write(uint32_t address, const uint8_t *data, int len)
{
    uint32_t off = ext_flash_addr(address);
    int ret = nor_flash_write(off, data, len);
    if (ret == 0 && len > 0)
        dcache_clean_invalidate_by_addr(OCTOSPI_MEM_BASE + off, len);
    return ret;
}

int RAMFUNCTION hal_flash_erase(uint32_t address, int len)
{
    uint32_t off = ext_flash_addr(address);
    int ret = nor_flash_erase(off, len);
    if (ret == 0 && len > 0)
        dcache_clean_invalidate_by_addr(OCTOSPI_MEM_BASE + off, len);
    return ret;
}

void RAMFUNCTION hal_flash_unlock(void)
{
}

void RAMFUNCTION hal_flash_lock(void)
{
}

/* ext_flash API: accepts both device-relative offsets (update/swap) and
 * absolute memory-mapped addresses (boot partition with PART_BOOT_EXT). */

static uint32_t RAMFUNCTION ext_flash_addr(uintptr_t address)
{
    /* Accept either alias of the 64 MB XSPI2 NOR region (0x70xxxxxx S,
     * 0x90xxxxxx NS) and convert to a device-relative offset. Anything
     * below both aliases is treated as already-offset (update/swap). */
    if (address >= OCTOSPI_MEM_BASE_NS &&
        address < (OCTOSPI_MEM_BASE_NS + OCTOSPI_MEM_SIZE))
        return (uint32_t)(address - OCTOSPI_MEM_BASE_NS);
    if (address >= OCTOSPI_MEM_BASE_S &&
        address < (OCTOSPI_MEM_BASE_S + OCTOSPI_MEM_SIZE))
        return (uint32_t)(address - OCTOSPI_MEM_BASE_S);
    return (uint32_t)address;
}

int RAMFUNCTION ext_flash_read(uintptr_t address, uint8_t *data, int len)
{
    /* Read via XIP memory-mapped alias. OCTOSPI_MEM_BASE is the alias
     * (0x70xxxxxx for non-TZ, 0x90xxxxxx for TZ) that the controller
     * is accessible through given current GTZC attribution. */
    volatile const uint8_t *src;
    uint32_t off = ext_flash_addr(address);
    int i;
    if (len <= 0)
        return 0;
    src = (volatile const uint8_t *)(OCTOSPI_MEM_BASE + off);
    for (i = 0; i < len; i++)
        data[i] = src[i];
    return len;
}

int RAMFUNCTION ext_flash_write(uintptr_t address, const uint8_t *data,
    int len)
{
    uint32_t off = ext_flash_addr(address);
    int ret = nor_flash_write(off, data, len);
    /* Invalidate D-cache for the XIP alias, otherwise later reads of the
     * just-written region return stale data from cache. */
    if (ret == 0 && len > 0)
        dcache_clean_invalidate_by_addr(OCTOSPI_MEM_BASE + off, len);
    return ret;
}

int RAMFUNCTION ext_flash_erase(uintptr_t address, int len)
{
    uint32_t off = ext_flash_addr(address);
    int ret = nor_flash_erase(off, len);
    if (ret == 0 && len > 0)
        dcache_clean_invalidate_by_addr(OCTOSPI_MEM_BASE + off, len);
    return ret;
}

void RAMFUNCTION ext_flash_lock(void)
{
}

void RAMFUNCTION ext_flash_unlock(void)
{
}
